Catalogs/DMS_ПривилегииВладельцамБонусныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_ПривилегииВладельцамБонусныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачисляютсяБонусыВДеньРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставляетсяБесплатнаяУслугаРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныйМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БесплатныеРаботыУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/DMS_ПривилегииВладельцамБонусныхКарт/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура НачисляютсяБонусыПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПредоставляетсяБесплатнаяУслугаРаботаПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныйМенеджерПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
 
&НаСервере
Процедура УстановитьВидимость()

	Элементы.СуммаБонуса.Видимость 		 	  = Объект.НачисляютсяБонусыВДеньРожденияКлиента;	
	Элементы.БесплатныеРаботыУслуги.Видимость = Объект.ПредоставляетсяБесплатнаяУслугаРабота;	
	Элементы.Менеджер.Видимость 			  = Объект.ПерсональныйМенеджер;	
	
	Если Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.ПерсональныйМенеджерМастерПриемщик Тогда
		Элементы.ГруппаНачислениеБонусов.Видимость 	   = Ложь;	
		Элементы.ГруппаБеслатныеРаботыУслуги.Видимость = Ложь;	
	ИначеЕсли Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.ПодарочныеБаллыВДеньРождения Тогда
		Элементы.ГруппаПерсональныйМенеджер.Видимость  = Ложь;	
		Элементы.ГруппаБеслатныеРаботыУслуги.Видимость = Ложь;
	ИначеЕсли Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.БесплатныеНапиткиПриОбслуживанииВТЦ
		Или Объект.Ссылка = Справочники.DMS_ПривилегииВладельцамБонусныхКарт.СтраховкаНаДом Тогда
		
		Элементы.ГруппаПерсональныйМенеджер.Видимость = Ложь;	
		Элементы.ГруппаНачислениеБонусов.Видимость 	  = Ложь;	
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьВидимость()
